12/data/attachments/b0a40b79f61730ed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_087ae82e-0f29-415c-8b0e-bfe8c0eedb26</nif:username>
            <nif:friendToBeAdded>Melissa_food_Actions_37800_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>